# ScopeBoxWrongPosition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DatumPlaneFailures..::..ScopeBoxWrongPosition Property
BuiltInFailures..::..DatumPlaneFailures Class See Also
---
The Highlighted Datum cannot be associated with the specified Scope Box because the Datum plane does not intersect the Scope Box.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ScopeBoxWrongPosition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ScopeBoxWrongPosition As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ScopeBoxWrongPosition {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DatumPlaneFailures Class
Autodesk.Revit.DB Namespace